### Problem 1) Recreate below output dataframe using 

#### i) lists
#### ii) dictionary
#### iii) Series (pd.Series)

In [7]:
#THIS SHOULD BE YOUR OUTPUT    (don't run this shell)

    Name  Age    Address Qualification
0    Raj   27      Delhi            BE
1  Rahul   24        NaN            MA
2  Yadav   22  Bangalore           MCA
3  Abhay   32     Mumbai           Phd

#### Solution

In [ ]:
#your code here

### Problem 2

#### i) In Problem 1 dataframe, add another column 'Gender'  with values , Raj as 'Male' , Rahul as 'Male' , Yadav as 'NaN', Abhay as 'Male'
#### ii) In the 'Gender' column fill the NaN value with 'Not Disclosed'
#### iii)Use 'method' attribute of fillna() to  fill the NaN value in 'Address' column with the value next to it.

#### Solution

In [ ]:
#your code here

### Problem 3

#### i) Analyse and gather information in the dataset 'water_potability.csv' using DataFrame methods (like .index , .describe() etc. )
#### ii) Fill the missing values in 'Sulfate' column by the mean value of column 'Sulfate'.
#### iii) In the Potability column : 0 means water is not potable and 1 means water is potable. Get the count of rows having a) Potable water b) Non Potable water
#### iv) Get the 'ph' value of all rows which are potable water.

#### Solution

In [ ]:
#your code here